insert into plant_type(id, name) values
(1, "토마토"),
(2, "딸기");

insert into plant_statistics(created_at, type_id, avg_maturity, disease_ratio) values
('2026-05-07 13:21:00', 1, 0.14, 0.0),
('2026-05-07 13:21:00', 2, 0.29, 0.25),

('2026-05-08 13:21:00', 1, 0.16, 0.0),
('2026-05-08 13:21:00', 2, 0.31, 0.25),

('2026-05-09 13:25:00', 1, 0.20, 0.25),
('2026-05-09 13:25:00', 2, 0.35, 0.25),

('2026-05-10 13:31:00', 1, 0.24, 0.25),
('2026-05-10 13:31:00', 2, 0.39, 0.50),

('2026-05-11 13:16:00', 1, 0.38, 0.25),
('2026-05-11 13:16:00', 2, 0.43, 0.50),

('2026-05-12 13:20:00', 1, 0.41, 0.0),
('2026-05-12 13:20:00', 2, 0.485, 0.25);

insert into plant(id, name, type_id, maturity, is_disease) values
(1, "토마토 1", 1, 0.64, 0),
(2, "토마토 2", 1, 0.61, 0),
(3, "토마토 3", 1, 0.67, 0),
(4, "토마토 4", 1, 0.6, 0);

insert into plant(id, name, type_id, maturity, is_disease)values
(5, "딸기 1", 2, 0.45, 1),
(6, "딸기 2", 2, 0.49, 0),
(7, "딸기 3", 2, 0.50, 0),
(8, "딸기 4", 2, 0.50, 0);


insert into sensor_type(id, type_name) values
(1, "조도"),
(2, "습도"),
(3, "온도"),
(4, "화염");

insert into sensor(id, type_id, value) values
(0, 1, 0),
(1, 2, 0),
(2, 3, 0),
(3, 4, 0);